app/controllers/blogs_controller.rb

def create
 @blog = current_user.blogs.new(params[:blog])
# @blog.user_id =current_user.id
       if @blog.save
---
INSERT INTO `blogs` (`blog_name`, `created_at`, `photo_file_size`, `blog_email`, `updated_at`, `photo_file_name`, `blog_description`, `photo_content_type`, `category_id`, `photo_updated_at`, `user_id`) VALUES('car', '2010-08-19 07:12:53', NULL, 'ed@v.com', '2010-08-19 07:12:53', NULL, 'good', NULL, '5', NULL, NULL)

def edit
  @blog = Blog.find(params[:id])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 3)

def update
    @blog = Blog.find(params[:id])
    if @blog.update_attributes(params[:blog])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 3)
UPDATE `blogs` SET `updated_at` = '2010-08-18 06:29:47', `blog_description` = 'good', `category_id` = '5' WHERE `id` = 3

  def destroy
     @blog=Blog.find(params[:id])
    if @blog.destroy
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 1)
DELETE FROM `blogs` WHERE `id` = 1