app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])
      if @category.save
---
INSERT INTO `categories` (`created_at`, `category_name`, `updated_at`) VALUES('2010-08-17 06:42:28', 'rtrtr', '2010-08-17 06:42:28')

   def edit
    @category = Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)

  def update
    @category = Category.find(params[:id])
    if @category.update_attributes(params[:category])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
UPDATE `categories` SET `updated_at` = '2010-08-17 12:35:33', `category_name` = 'carrrrrrrrrrrrrr' WHERE `id` = 3

  def destroy
     @category=Category.find(params[:id])
    if @category.destroy
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
DELETE FROM `categories` WHERE `id` = 1