app/controllers/comments_controller.rb

  def new
   @blog= Blog.find(params[:id])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 5)

  def create
#    @blog= Blog.find(params[:id])
#puts @blog
@blog= Blog.find(params[:blog_id])

    @comment = @blog.comments.new(params[:comment])
    @comment.posted_date =DateTime.now
    #@comment.user_id     =Blog.user_id
      if @comment.save
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 3)
INSERT INTO `comments` (`posted_by`, `posted_date`, `blog_id`, `user_id`, `comments_description`, `email`) VALUES('test', '2010-08-24 17:35:12', 1, NULL, 'haiiiiiiiii', 'test@test.com')

  def show
    @blog = Blog.find(params[:id])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 3)