app/controllers/home_controller.rb

SELECT * FROM `blogs` LIMIT 0, 2
SELECT count(*) AS count_all FROM `blogs`
---
  def index
    #@blogs=Blog.find(:all)
    @blogs=Blog.paginate :per_page => 2, :page => params[:page]