app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `user_code`, `remember_token`, `login`, `email`) VALUES('', '03846435275cd1a55bb3cbfcc79f223379c258cb', '2010-08-25 09:28:59', 'cbfd94eb01a1ddf66d203bbdb851c0a271ab19d5', NULL, '2010-08-25 09:28:59', NULL, NULL, 'tgg', 'gfg@gf.com')